namespace AITalkEditor
{
    using AITalkEditor.Properties;
    using System;
    using System.Drawing;
    using System.Windows.Forms;

    internal static class zunko
    {
        private static string[] CreateNGWordList()
        {
            return new string[] { 
                "足コキ", "アナル", "アヌス", "あきめくら", "慰安婦", "いざり", "犬殺し", "イラマチオ", "陰核", "淫姦", "陰茎", "陰唇", "陰嚢", "淫乱", "ヴァギナ", "ウンコ", 
                "穢多", "オーガズム", "犯す", "オチンチン", "オナチン", "オナニー", "おっぱい", "おまんこ", "オマンタン", "おまんちょ", "オメコ", "かたわ", "がまん汁", "河原乞食", "姦淫", "顔射", 
                "騎乗位", "気違い", "キチガイ", "亀頭", "業病", "巨根", "金玉", "キンタマ", "くまんこ", "クリトリス", "クンニ", "クリトリス", "クンニリングス", "毛唐", "強姦", "コーマン", 
                "コンドーム", "三国人", "自慰", "Ｇスポット", "死姦", "支那", "シックスナイン", "射精", "獣姦", "処女膜", "小便", "しょんべん", "新平民", "スカトロ", "スケマン", "素股", 
                "精液", "正常位", "精神異常", "セックス", "せむし", "鮮人", "早漏", "粗チン", "ソリマン", "大陰唇", "タダマン", "タマキン", "玉袋", "男根", "乳首", "遅漏", 
                "ちんかす", "ちんこ", "ちんしこ", "チン長", "チンチン", "ちんぱ", "ちんぽ", "ちんぼう", "ちんぽこ", "つんぼ", "ディープスロート", "低脳", "手コキ", "土方", "ドカタ", "特殊部落", 
                "屠殺", "土人", "トルコ嬢", "トルコ風呂", "中出し", "嬲る", "生フェラ", "生本番", "南鮮", "人夫", "ヌレマン", "パイズリ", "パイパン", "白痴", "ハミチン", "ハメ撮り", 
                "パンチラ", "跛", "非人", "フェラ", "フェラチオ", "プッシィ", "部落", "部落民", "文盲", "ペニス", "ペニスバンド", "暴姦", "包茎", "放尿", "北鮮", "ポコチン", 
                "マスターベーション", "マン開", "まんかす", "まん金", "まんぐり返し", "マンスジ", "マンズリ", "マン拓", "満膣", "マンチン", "マンピー", "まんびら", "めくら", "メコスジ", "もりマン", "ヤリマン", 
                "乱姦", "乱交", "陵虐", "凌虐", "凌犯", "レイプ", "あしこき", "あなる", "あぬす", "あきめくら", "いあんふ", "いざり", "いぬごろし", "いらまちお", "いんかく", "いんかん", 
                "いんけい", "いんしん", "いんのう", "いんらん", "う゛ぁぎな", "うんこ", "おーがずむ", "おちんちん", "おなちん", "おなにー", "おまんこ", "おまんたん", "おまんちょ", "おめこ", "かたわ", "がまんじる", 
                "かわらこじき", "かんいん", "がんしゃ", "きじょうい", "きちがい", "きちがい", "ぎょうびょう", "きんたま", "きんたま", "くまんこ", "くりとりす", "くんに", "くりとりす", "くんにりんぐす", "けとう", "ごうかん", 
                "こーまん", "こんどーむ", "さんごくじん", "じーすぽっと", "しょうべん", "しんへいみん", "すかとろ", "すけまん", "すまた", "せいえき", "せいじょうい", "せいしんいじょう", "せっくす", "せむし", "そちん", "そりまん", 
                "だいいんしん", "ただまん", "たまきん", "たまぶくろ", "だんこん", "ちくび", "ちろう", "ちんかす", "ちんこ", "ちんしこ", "ちんちん", "ちんぱ", "ちんぽ", "ちんぼう", "ちんぽこ", "つんぼ", 
                "でぃーぷすろーと", "ていのう", "てこき", "どかた", "どかた", "とくしゅぶらく", "どじん", "とるこじょう", "とるこぶろ", "なかだし", "なぶる", "なまふぇら", "なまほんばん", "なんせん", "ぬれまん", "ぱいずり", 
                "ぱいぱん", "はみちん", "はめどり", "ぱんちら", "びっこ", "ふぇら", "ふぇらちお", "ぷっしぃ", "ぶらく", "ぶらくみん", "ぶんもう", "ぺにす", "ぺにすばんど", "ほうにょう", "ほくせん", "ぽこちん", 
                "ますたーべーしょん", "まんかす", "まんきん", "まんぐりがえし", "まんすじ", "まんずり", "まんたく", "まんちつ", "まんちん", "まんぴー", "まんびら", "めくら", "めこすじ", "もりまん", "やりまん", "りょうぎゃく", 
                "りょうぎゃく", "れいぷ", "アイヌ系", "青姦", "明盲", "アメ公", "躄", "伊勢乞食", "イタ公", "犬殺し", "淫売", "うんこ", "エスキモー", "穢多", "越後の米つき", "沖仲仕", 
                "唖", "落人部落", "おわい屋", "隠坊", "拡張団", "拡張団長", "かさっかき", "片肺", "片端", "がちゃ目", "かったい", "河原乞食", "姦通", "キ印", "キチ", "気違い", 
                "気違い沙汰", "気違いに刃物", "狂女", "苦力", "黒んぼ", "クンニ", "毛唐", "強姦", "紅毛人", "虚仮", "乞食", "三韓征伐", "三国人", "三助", "支那", "支那人", 
                "支那竹", "支那料理", "新平民", "傴僂", "鮮人", "千摺り", "チャンコロ", "中共", "朝鮮征伐", "チョン", "跛", "聾", "聾桟敷", "手ん棒", "特殊部落", "屠殺人", 
                "トルコ嬢", "トルコ風呂", "ナオン", "南鮮", "南部の鮭の鼻まがり", "ニガー", "ニグロ", "人非人", "馬鹿チョンカメラ", "馬鹿でもチョンでも", "白痴", "半島人", "跛", "非人", "不具", "ペイ患", 
                "ペイ中", "北鮮", "ポコペン", "マンコ", "三つ口", "盲", "めっかち", "蒙古症", "盲人", "癩病", "ルンペン", "露助", "ロンパリ", "あいぬけい", "あおかん", "あきめくら", 
                "あめこう", "いせこじき", "いたこう", "いぬごろし", "いんばい", "うんこ", "えすきもー", "えちごのこめつき", "おきなかし", "おちうどぶらく", "おわいや", "おんぼう", "かくちょうだん", "かくちょうだんちょう", "かさっかき", "かたはい", 
                "がちゃめ", "かったい", "かわらこじき", "かんつう", "きじるし", "きちがい", "きちがいざた", "きちがいにはもの", "きょうじょ", "くーりー", "くろんぼ", "ごうかん", "こうもうじん", "さんかんせいばつ", "さんごくじん", "さんすけ", 
                "しなじん", "しなちく", "しなりょうり", "しんへいみん", "せむし", "せんじん", "せんずり", "ちゃんころ", "ちゅうきょう", "ちょうせんせいばつ", "ちんば", "つんぼ", "つんぼさじき", "てんぼう", "とくしゅぶらく", "とさつにん", 
                "とるこじょう", "とるこぶろ", "なおん", "なんせん", "なんぶのしゃけのはなまがり", "にがー", "にぐろ", "にんぴにん", "ばかちょんかめら", "ばかでもちょんでも", "はんとうじん", "びっこ", "ぺいかん", "ぺいちゅう", "ぽこぺん", "まんこ", 
                "みつくち", "めくら", "めっかち", "もうこしょう", "もうじん", "らいびょう", "るんぺん", "ろんぱり"
             };
        }

        [STAThread]
        private static void Main(string[] args)
        {
            Application.EnableVisualStyles();
            Application.SetCompatibleTextRenderingDefault(false);
            AppSettings appSettings = VOICEROID.CreateAppSettings(args);
            appSettings.AuthCode = "NqKN148elpuO2tmdCMCU";
            appSettings.Title = "VOICEROID＋ 東北ずん子";
            appSettings.Icon = AITalkEditor.Properties.Resources.face;
            appSettings.AppLogo = AITalkEditor.Properties.Resources.logo;
            appSettings.TitleView.AppLogoSizeMode = PictureBoxSizeMode.Zoom;
            appSettings.TitleView.AppLogoLocation = new Point(80, 0x40);
            appSettings.TitleView.AppLogoSize = new Size(240, 100);
            appSettings.VersionInfoImage = AITalkEditor.Properties.Resources.version_info;
            appSettings.View.VoiceImage.ImageList.Add(AITalkEditor.Properties.Resources.fg00);
            appSettings.View.VoiceImage.ImageList.Add(AITalkEditor.Properties.Resources.fg01);
            appSettings.View.VoiceImage.ImageList.Add(AITalkEditor.Properties.Resources.fg00);
            appSettings.View.VoiceImage.BackColor = Color.FromArgb(0xeb, 0xf6, 0xcd);
            appSettings.NGWord.Enabled = true;
            appSettings.NGWord.SetItems(CreateNGWordList());
            appSettings.NGWord.Message = "ずん子にそんな言葉を喋らせてはいけませんよ？";
            MainPresenter.Run(appSettings);
        }
    }
}

